In [3]:
import pandas as pd

In [6]:
df =pd.read_csv('G23_Fashion â€“ Designers  Collections with Fashion Shows_merged (1).csv', sep = ',')

In [7]:
Designers=df.loc[:,['designer_id', 'name', 'nationality',]]

In [8]:
Designers.head(3)

   designer_id            name nationality
0           46   Charles Green     Finland
1           78     Robert Webb   Lithuania
2           12  Elizabeth Reid      Panama

In [9]:
Designers=Designers.sort_values(by='designer_id')

In [11]:
Designers.head(5)

     designer_id           name nationality
233            1    David Horne     Algeria
91             1    David Horne     Algeria
264            1    David Horne     Algeria
366            1    David Horne     Algeria
322            2  Stacy Lindsey     Liberia

In [12]:
Designers.drop_duplicates(inplace=True)

In [13]:
Designers.head(5)

     designer_id           name                    nationality
233            1    David Horne                        Algeria
322            2  Stacy Lindsey                        Liberia
219            3   Mason Garcia                        Reunion
190            4   Joseph Walsh                      Argentina
88             5    Corey Burns  Holy See (Vatican City State)

In [15]:
import sqlite3
conexao = sqlite3.connect('FashionDesigners.db')
Designers.to_sql('Designers', conexao, if_exists='replace', index=False)
conexao.close()